node {
  name: "TFRecordReaderV2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "filename_queue/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 256
          }
        }
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00000-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00001-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00002-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00003-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00004-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00005-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00006-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00007-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00168-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00169-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00170-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00171-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00172-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00173-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00174-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00175-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00176-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00177-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00178-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00179-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00180-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00181-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00182-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00183-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00184-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00185-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00186-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00187-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00188-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00189-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00190-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00191-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00192-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00071-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00072-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00073-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00074-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00075-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00076-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00077-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00078-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00079-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00080-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00081-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00082-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00083-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00084-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00085-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00086-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00087-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00088-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00089-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00090-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00091-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00216-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00217-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00218-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00219-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00220-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00221-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00222-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00223-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00224-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00225-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00226-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00227-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00228-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00229-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00230-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00231-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00232-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00233-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00234-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00235-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00236-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00237-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00238-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00239-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00240-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00008-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00024-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00046-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00070-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00092-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00112-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00142-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00167-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00193-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00215-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00241-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00113-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00114-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00115-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00116-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00117-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00118-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00119-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00120-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00121-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00122-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00123-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00124-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00125-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00126-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00127-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00128-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00129-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00130-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00131-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00132-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00133-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00134-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00135-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00136-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00137-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00138-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00139-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00140-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00141-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00025-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00026-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00027-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00028-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00029-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00030-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00031-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00032-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00033-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00034-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00035-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00036-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00037-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00038-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00039-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00040-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00041-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00042-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00043-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00044-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00045-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00143-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00144-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00145-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00146-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00147-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00148-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00149-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00150-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00151-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00152-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00153-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00154-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00155-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00156-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00157-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00158-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00159-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00160-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00161-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00162-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00163-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00164-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00165-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00166-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00242-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00243-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00244-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00245-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00246-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00247-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00248-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00249-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00250-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00251-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00252-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00253-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00254-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00255-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00093-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00094-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00095-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00096-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00097-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00098-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00099-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00100-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00101-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00102-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00103-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00104-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00105-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00106-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00107-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00108-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00109-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00110-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00111-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00194-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00195-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00196-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00197-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00198-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00199-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00200-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00201-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00202-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00203-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00204-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00205-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00206-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00207-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00208-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00209-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00210-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00211-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00212-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00213-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00214-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00047-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00048-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00049-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00050-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00051-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00052-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00053-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00054-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00055-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00056-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00057-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00058-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00059-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00060-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00061-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00062-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00063-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00064-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00065-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00066-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00067-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00068-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00069-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00009-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00010-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00011-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00012-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00013-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00014-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00015-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00016-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00017-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00018-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00019-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00020-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00021-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00022-of-00256"
        string_val: "/media/thunder/soft/MSCOCO-tfrecord/tfrecord/train-00023-of-00256"
      }
    }
  }
}
node {
  name: "filename_queue/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 256
      }
    }
  }
}
node {
  name: "filename_queue/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "filename_queue/Greater"
  op: "Greater"
  input: "filename_queue/Size"
  input: "filename_queue/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filename_queue/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "filename_queue/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "filename_queue/Assert/Assert"
  op: "Assert"
  input: "filename_queue/Greater"
  input: "filename_queue/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "filename_queue/Identity"
  op: "Identity"
  input: "filename_queue/Const"
  input: "^filename_queue/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
}
node {
  name: "filename_queue/RandomShuffle"
  op: "RandomShuffle"
  input: "filename_queue/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "filename_queue"
  op: "FIFOQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 16
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "filename_queue/filename_queue_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "filename_queue"
  input: "filename_queue/RandomShuffle"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "filename_queue/filename_queue_Close"
  op: "QueueCloseV2"
  input: "filename_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "filename_queue/filename_queue_Close_1"
  op: "QueueCloseV2"
  input: "filename_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "filename_queue/filename_queue_Size"
  op: "QueueSizeV2"
  input: "filename_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filename_queue/ToFloat"
  op: "Cast"
  input: "filename_queue/filename_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filename_queue/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0625
      }
    }
  }
}
node {
  name: "filename_queue/mul"
  op: "Mul"
  input: "filename_queue/ToFloat"
  input: "filename_queue/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "filename_queue/fraction_of_16_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "filename_queue/fraction_of_16_full"
      }
    }
  }
}
node {
  name: "filename_queue/fraction_of_16_full"
  op: "ScalarSummary"
  input: "filename_queue/fraction_of_16_full/tags"
  input: "filename_queue/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "random_input_queue"
  op: "RandomShuffleQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 7800
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "min_after_dequeue"
    value {
      i: 4600
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
  attr {
    key: "shapes"
    value {
      list {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "ReaderReadV2"
  op: "ReaderReadV2"
  input: "TFRecordReaderV2"
  input: "filename_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "random_input_queue_enqueue"
  op: "QueueEnqueueV2"
  input: "random_input_queue"
  input: "ReaderReadV2:1"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "random_input_queue_Close"
  op: "QueueCloseV2"
  input: "random_input_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "random_input_queue_Close_1"
  op: "QueueCloseV2"
  input: "random_input_queue"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "random_input_queue_Size"
  op: "QueueSizeV2"
  input: "random_input_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "Cast"
  op: "Cast"
  input: "random_input_queue_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.00012820512347389013
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "Cast"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "queue/random_input_queue/fraction_of_7800_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "queue/random_input_queue/fraction_of_7800_full"
      }
    }
  }
}
node {
  name: "queue/random_input_queue/fraction_of_7800_full"
  op: "ScalarSummary"
  input: "queue/random_input_queue/fraction_of_7800_full/tags"
  input: "mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "random_input_queue_Dequeue"
  op: "QueueDequeueV2"
  input: "random_input_queue"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "ParseSingleSequenceExample/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleSequenceExample/ParseSingleSequenceExample/feature_list_dense_missing_assumed_empty"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "ParseSingleSequenceExample/ParseSingleSequenceExample/context_dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/data"
      }
    }
  }
}
node {
  name: "ParseSingleSequenceExample/ParseSingleSequenceExample/feature_list_dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "image/caption_ids"
      }
    }
  }
}
node {
  name: "ParseSingleSequenceExample/ParseSingleSequenceExample/debug_name"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "ParseSingleSequenceExample/ParseSingleSequenceExample"
  op: "ParseSingleSequenceExample"
  input: "random_input_queue_Dequeue"
  input: "ParseSingleSequenceExample/ParseSingleSequenceExample/feature_list_dense_missing_assumed_empty"
  input: "ParseSingleSequenceExample/ParseSingleSequenceExample/context_dense_keys_0"
  input: "ParseSingleSequenceExample/ParseSingleSequenceExample/feature_list_dense_keys_0"
  input: "ParseSingleSequenceExample/Const"
  input: "ParseSingleSequenceExample/ParseSingleSequenceExample/debug_name"
  attr {
    key: "Ncontext_dense"
    value {
      i: 1
    }
  }
  attr {
    key: "Ncontext_sparse"
    value {
      i: 0
    }
  }
  attr {
    key: "Nfeature_list_dense"
    value {
      i: 1
    }
  }
  attr {
    key: "Nfeature_list_sparse"
    value {
      i: 0
    }
  }
  attr {
    key: "Tcontext_dense"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "context_dense_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "context_sparse_types"
    value {
      list {
      }
    }
  }
  attr {
    key: "feature_list_dense_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "feature_list_dense_types"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "feature_list_sparse_types"
    value {
      list {
      }
    }
  }
}
node {
  name: "decode/DecodeJpeg"
  op: "DecodeJpeg"
  input: "ParseSingleSequenceExample/ParseSingleSequenceExample"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "acceptable_fraction"
    value {
      f: 1.0
    }
  }
  attr {
    key: "channels"
    value {
      i: 3
    }
  }
  attr {
    key: "dct_method"
    value {
      s: ""
    }
  }
  attr {
    key: "fancy_upscaling"
    value {
      b: true
    }
  }
  attr {
    key: "ratio"
    value {
      i: 1
    }
  }
  attr {
    key: "try_recover_truncated"
    value {
      b: false
    }
  }
}
node {
  name: "convert_image/Cast"
  op: "Cast"
  input: "decode/DecodeJpeg"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "convert_image/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.003921568859368563
      }
    }
  }
}
node {
  name: "convert_image"
  op: "Mul"
  input: "convert_image/Cast"
  input: "convert_image/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "ExpandDims"
  op: "ExpandDims"
  input: "convert_image"
  input: "ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "original_image/tag"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "original_image"
      }
    }
  }
}
node {
  name: "original_image"
  op: "ImageSummary"
  input: "original_image/tag"
  input: "ExpandDims"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "bad_color"
    value {
      tensor {
        dtype: DT_UINT8
        tensor_shape {
          dim {
            size: 4
          }
        }
        int_val: 255
        int_val: 0
        int_val: 0
        int_val: 255
      }
    }
  }
  attr {
    key: "max_images"
    value {
      i: 3
    }
  }
}
node {
  name: "resize_images/ExpandDims/dim"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "resize_images/ExpandDims"
  op: "ExpandDims"
  input: "convert_image"
  input: "resize_images/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: -1
          }
          dim {
            size: -1
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "resize_images/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "Z\001\000\000Z\001\000\000"
      }
    }
  }
}
node {
  name: "resize_images/ResizeBilinear"
  op: "ResizeBilinear"
  input: "resize_images/ExpandDims"
  input: "resize_images/size"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 346
          }
          dim {
            size: 346
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "align_corners"
    value {
      b: false
    }
  }
}
node {
  name: "resize_images/Squeeze"
  op: "Squeeze"
  input: "resize_images/ResizeBilinear"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 346
          }
          dim {
            size: 346
          }
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "random_crop/size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "+\001\000\000+\001\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "random_crop/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "Z\001\000\000Z\001\000\000\003\000\000\000"
      }
    }
  }
}
node {
  name: "random_crop/GreaterEqual"
  op: "GreaterEqual"
  input: "random_crop/Shape"
  input: "random_crop/size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "random_crop/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "random_crop/All"
  op: "All"
  input: "random_crop/GreaterEqual"
  input: "random_crop/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "random_crop/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Need value.shape >= size, got "
      }
    }
  }
}
node {
  name: "random_crop/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Need value.shape >= size, got "
      }
    }
  }
}
node {
  name: "random_crop/Assert/Assert"
  op: "Assert"
  input: "random_crop/All"
  input: "random_crop/Assert/Assert/data_0"
  input: "random_crop/Shape"
  input: "random_crop/size"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_INT32
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 1000
    }
  }
}
node {
  name: "random_crop/control_dependency"
  op: "Identity"
  input: "random_crop/Shape"
  input: "^random_crop/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@random_crop/Shape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "random_crop/sub"
  op: "Sub"
  input: "random_crop/control_dependency"
  input: "random_crop/size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "random_crop/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "random_crop/add"
  op: "Add"
  input: "random_crop/sub"
  input: "random_crop/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "random_crop/Shape_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "random_crop/random_uniform/min"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "random_crop/random_uniform/max"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
